<?php
/**
 * Created by PhpStorm.
 * User: CPR137
 * Date: 2017/5/27
 * Time: 14:14
 */
/*
                   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
         佛祖保佑       永无BUG
*/
#框架运行开发模式
defined('__ENVIRONMENT__') || define('__ENVIRONMENT__', 'develop');
#定义项目目录
defined('__PROJECT__') or define('__PROJECT__', dirname($_SERVER['DOCUMENT_ROOT']));
#载入框架入口脚本
require '../vendor/houduanniu/index.php';